src/Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения товаров на складе</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровОрдерныйСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровОрдерныйСклад</Name>
			<Comment>Остатки товаров на ордерном складе</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Храним ТОЛЬКО в базовых единицах измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Comment>Ячейка склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Используется только для аналитики. Это НЕ означает, что в ресурс «Количество» пишется в данной единице измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Catalogs/ЯчейкиХранения/Forms/ФормаСписка/Ext/Form/Module.bsl
// Модуль формы списка справочника "Ячейки хранения"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура для формирования списка по установленному варианту
//
&НаСервере
Процедура ФормированиеСпискаПоФильтру()
	
	Если ЗначениеЗаполнено(СкладКомпании) Тогда
		
		Если ВариантПодбора = 0 Тогда
			ВариантПодбора = 1;
		КонецЕсли;
		
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		
		Если ВариантПодбора = 1 Тогда
			
			// Отметим выбранный вариант фильтра
			Элементы.ВсеЯчейки.Пометка         = Истина;
			Элементы.ИмеетсяОстаток.Пометка    = Ложь;
			Элементы.СвободныеЯчейки.Пометка   = Ложь;
			Элементы.РанееИспользуемые.Пометка = Ложь;
			
			// Установим видимость дополнительных реквизитов
			Элементы.Остаток.Видимость           = Ложь;
			Элементы.ДатаИспользования.Видимость = Ложь;
			
			// Вывод всех ячеек склада
			Список.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ЯчейкиХранения.Ссылка,
			                      |	ЯчейкиХранения.ПометкаУдаления,
			                      |	ЯчейкиХранения.Владелец,
			                      |	ЯчейкиХранения.Родитель,
			                      |	ЯчейкиХранения.ЭтоГруппа,
			                      |	ЯчейкиХранения.Код,
			                      |	ЯчейкиХранения.ДлинаЯчейки,
			                      |	ЯчейкиХранения.ШиринаЯчейки,
			                      |	ЯчейкиХранения.КоординатаX,
			                      |	ЯчейкиХранения.КоординатаY,
			                      |	ЯчейкиХранения.Уровень,
			                      |	ЯчейкиХранения.ЦветГруппы,
			                      |	ЯчейкиХранения.Недоступна,
			                      |	ЯчейкиХранения.ДополнительныеРеквизиты,
			                      |	ЯчейкиХранения.Предопределенный,
			                      |	ЯчейкиХранения.ИмяПредопределенныхДанных,
			                      |	"""" КАК ДатаИспользования,
			                      |	0 КАК Остаток
			                      |ИЗ
			                      |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения";
			
		ИначеЕсли ВариантПодбора = 2 Тогда
			
			// Отметим выбранный вариант фильтра
			Элементы.ВсеЯчейки.Пометка         = Ложь;
			Элементы.ИмеетсяОстаток.Пометка    = Ложь;
			Элементы.СвободныеЯчейки.Пометка   = Истина;
			Элементы.РанееИспользуемые.Пометка = Ложь;
			
			// Установим видимость дополнительных реквизитов
			Элементы.Остаток.Видимость           = Ложь;
			Элементы.ДатаИспользования.Видимость = Ложь;
			
			// Вывод ячеек, которые свободные
			Список.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ЯчейкиХранения.Ссылка,
			                      |	ЯчейкиХранения.ПометкаУдаления,
			                      |	ЯчейкиХранения.Владелец,
			                      |	ЯчейкиХранения.Родитель,
			                      |	ЯчейкиХранения.ЭтоГруппа,
			                      |	ЯчейкиХранения.Код,
			                      |	ЯчейкиХранения.ДлинаЯчейки,
			                      |	ЯчейкиХранения.ШиринаЯчейки,
			                      |	ЯчейкиХранения.КоординатаX,
			                      |	ЯчейкиХранения.КоординатаY,
			                      |	ЯчейкиХранения.Уровень,
			                      |	ЯчейкиХранения.ЦветГруппы,
			                      |	ЯчейкиХранения.Недоступна,
			                      |	ЯчейкиХранения.ДополнительныеРеквизиты,
			                      |	ЯчейкиХранения.Предопределенный,
			                      |	ЯчейкиХранения.ИмяПредопределенныхДанных,
			                      |	"""" КАК ДатаИспользования,
			                      |	0 КАК Остаток
			                      |ИЗ
			                      |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
			                      |ГДЕ
			                      |	НЕ ЯчейкиХранения.Ссылка В
			                      |				(ВЫБРАТЬ
			                      |					ОстаткиТоваровОрдерныйСкладОстатки.Ячейка
			                      |				ИЗ
			                      |					РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(&МоментВремени, Ячейка.Владелец = &СкладКомпании) КАК ОстаткиТоваровОрдерныйСкладОстатки)";
			Список.Параметры.УстановитьЗначениеПараметра("СкладКомпании", СкладКомпании);
			Список.Параметры.УстановитьЗначениеПараметра("МоментВремени", МоментВремени.Значение);
			
		ИначеЕсли ВариантПодбора = 3 Тогда
			
			// Отметим выбранный вариант фильтра
			Элементы.ВсеЯчейки.Пометка         = Ложь;
			Элементы.ИмеетсяОстаток.Пометка    = Ложь;
			Элементы.СвободныеЯчейки.Пометка   = Ложь;
			Элементы.РанееИспользуемые.Пометка = Истина;
			
			// Установим видимость дополнительных реквизитов
			Элементы.Остаток.Видимость           = Ложь;
			Элементы.ДатаИспользования.Видимость = Истина;
			
			// Вывод ячеек, в которые ранее был помещен товар
			Список.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ЯчейкиХранения.Ссылка,
			                      |	ЯчейкиХранения.ПометкаУдаления,
			                      |	ЯчейкиХранения.Владелец,
			                      |	ЯчейкиХранения.Родитель,
			                      |	ЯчейкиХранения.ЭтоГруппа,
			                      |	ЯчейкиХранения.Код,
			                      |	ЯчейкиХранения.ДлинаЯчейки,
			                      |	ЯчейкиХранения.ШиринаЯчейки,
			                      |	ЯчейкиХранения.КоординатаX,
			                      |	ЯчейкиХранения.КоординатаY,
			                      |	ЯчейкиХранения.Уровень,
			                      |	ЯчейкиХранения.ЦветГруппы,
			                      |	ЯчейкиХранения.Недоступна,
			                      |	ЯчейкиХранения.ДополнительныеРеквизиты,
			                      |	ЯчейкиХранения.Предопределенный,
			                      |	ЯчейкиХранения.ИмяПредопределенныхДанных,
								  |	ВложенныйЗапрос.Период КАК ДатаИспользования,
			                      |	0 КАК Остаток
								  |ИЗ
								  |	(ВЫБРАТЬ
								  |		ЯчейкиХранения.Ссылка КАК Ссылка,
								  |		МАКСИМУМ(ОстаткиТоваровОрдерныйСклад.Период) КАК Период
								  |	ИЗ
								  |		РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
								  |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЯчейкиХранения КАК ЯчейкиХранения
								  |			ПО ОстаткиТоваровОрдерныйСклад.Ячейка = ЯчейкиХранения.Ссылка
			                      |ГДЕ
			                      |	ОстаткиТоваровОрдерныйСклад.СкладКомпании = &СкладКомпании
			                      |	И ОстаткиТоваровОрдерныйСклад.Номенклатура = &Номенклатура
			                      |	И ОстаткиТоваровОрдерныйСклад.ВидДвижения = &ВидДвижения
			                      |	И ОстаткиТоваровОрдерныйСклад.МоментВремени < &ДатаОкончания
								  |	
								  |	СГРУППИРОВАТЬ ПО
								  |		ЯчейкиХранения.Ссылка) КАК ВложенныйЗапрос
								  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЯчейкиХранения КАК ЯчейкиХранения
								  |		ПО ВложенныйЗапрос.Ссылка = ЯчейкиХранения.Ссылка";
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура",  Номенклатура);
			Список.Параметры.УстановитьЗначениеПараметра("СкладКомпании", СкладКомпании);
			Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", МоментВремени.Значение);
			Список.Параметры.УстановитьЗначениеПараметра("ВидДвижения",   ВидДвиженияНакопления.Приход);
			
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			
		ИначеЕсли ВариантПодбора = 4 Тогда
			
			// Отметим выбранный вариант фильтра
			Элементы.ВсеЯчейки.Пометка         = Ложь;
			Элементы.ИмеетсяОстаток.Пометка    = Истина;
			Элементы.СвободныеЯчейки.Пометка   = Ложь;
			Элементы.РанееИспользуемые.Пометка = Ложь;
			
			// Установим видимость дополнительных реквизитов
			Элементы.Остаток.Видимость           = Истина;
			Элементы.ДатаИспользования.Видимость = Ложь;
			
			// Вывод ячеек, в которых имеется необходимая номенклатура
			Список.ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ЯчейкиХранения.Ссылка,
			                      |	ЯчейкиХранения.ПометкаУдаления,
			                      |	ЯчейкиХранения.Владелец,
			                      |	ЯчейкиХранения.Родитель,
			                      |	ЯчейкиХранения.ЭтоГруппа,
			                      |	ЯчейкиХранения.Код,
			                      |	ЯчейкиХранения.ДлинаЯчейки,
			                      |	ЯчейкиХранения.ШиринаЯчейки,
			                      |	ЯчейкиХранения.КоординатаX,
			                      |	ЯчейкиХранения.КоординатаY,
			                      |	ЯчейкиХранения.Уровень,
			                      |	ЯчейкиХранения.ЦветГруппы,
			                      |	ЯчейкиХранения.Недоступна,
			                      |	ЯчейкиХранения.ДополнительныеРеквизиты,
			                      |	ЯчейкиХранения.Предопределенный,
			                      |	ЯчейкиХранения.ИмяПредопределенныхДанных,
			                      |	"""" КАК ДатаИспользования,
			                      |	ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток КАК Остаток
			                      |ИЗ
			                      |	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
			                      |			&ДатаОкончания,
			                      |			Номенклатура = &Номенклатура
			                      |				И Ячейка.Владелец = &СкладКомпании) КАК ОстаткиТоваровОрдерныйСкладОстатки
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЯчейкиХранения КАК ЯчейкиХранения
			                      |		ПО ОстаткиТоваровОрдерныйСкладОстатки.СкладКомпании = ЯчейкиХранения.Владелец
			                      |			И ОстаткиТоваровОрдерныйСкладОстатки.Ячейка = ЯчейкиХранения.Ссылка";
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);
			Список.Параметры.УстановитьЗначениеПараметра("СкладКомпании", СкладКомпании);
			Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", МоментВремени.Значение);
			
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
	Иначе
		
		// Установка видимости дополнительных реквизитов списка
		Элементы.Остаток.Видимость           = Ложь;
		Элементы.ДатаИспользования.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ФормированиеСпискаПоФильтру()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// Видимость
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры // УстановитьУсловноеОформление()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопок подменю "Фильтр".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура УстановкаФильтра(Команда)
	
	Если Команда.Имя = "ВсеЯчейки" Тогда
		ВариантПодбора = 1;
	ИначеЕсли Команда.Имя = "СвободныеЯчейки" Тогда
		ВариантПодбора = 2;
	ИначеЕсли Команда.Имя = "РанееИспользуемые" Тогда
		ВариантПодбора = 3;
	ИначеЕсли Команда.Имя = "ИмеетсяОстаток" Тогда
		ВариантПодбора = 4;
	КонецЕсли;
	
	ФормированиеСпискаПоФильтру();
	
КонецПроцедуры // УстановкаФильтра()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего на клиенте при изменении текущего родителя в режиме иерархического списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриСменеТекущегоРодителя(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриСменеТекущегоРодителя()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при окончании перетаскивания в поле-приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПеретаскивание()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Установим значение дополнительных реквизитов
	СкладКомпании = ПолучитьЗначениеПараметраСтруктуры(Параметры.Отбор, "Владелец",     Неопределено);
	Номенклатура  = ПолучитьЗначениеПараметраСтруктуры(Параметры,       "Номенклатура", Неопределено);
	
	// Сформируем момент времени для получения данных
	СсылкаНаОбъект = ПолучитьЗначениеПараметраСтруктуры(Параметры,       "Ссылка", Неопределено);
	
	Если СсылкаНаОбъект = Неопределено ИЛИ НЕ ОбщегоНазначения.ЭтоДокумент(СсылкаНаОбъект.Метаданные()) Тогда
		МоментВремени = Новый Граница(Новый МоментВремени(КонецДня(ТекущаяДатаСеанса())), ВидГраницы.Исключая);
	Иначе
		Если СсылкаНаОбъект.Пустая() Тогда
			ДатаДокумента = ПолучитьЗначениеПараметраСтруктуры(Параметры.Отбор, "Дата", ТекущаяДатаСеанса());
			МоментВремени = Новый Граница(Новый МоментВремени(КонецДня(ДатаДокумента)), ВидГраницы.Исключая);
		Иначе
			МоментВремени = Новый Граница(СсылкаНаОбъект.МоментВремени(), ВидГраницы.Исключая);
		КонецЕсли;
	КонецЕсли;
	
	// Проверим возможность вывода подменю "Фильтр"
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныйСклад") Тогда
		
		// Установим доступность фильтров
		ЕстьСклад = ЗначениеЗаполнено(СкладКомпании);
		Элементы.ВсеЯчейки.Доступность         = ЕстьСклад;
		Элементы.СвободныеЯчейки.Доступность   = ЕстьСклад;
		Элементы.ИмеетсяОстаток.Доступность    = ЕстьСклад И ЗначениеЗаполнено(Номенклатура) И ПолучитьЗначениеПараметраСтруктуры(Параметры, "ФильтрПоОстатку", Истина);
		Элементы.РанееИспользуемые.Доступность = ЕстьСклад И ЗначениеЗаполнено(Номенклатура) И ПолучитьЗначениеПараметраСтруктуры(Параметры, "ФильтрПоИспользуемымЯчейкам", Истина);
		
		// Установим начальное положение фильтра
		ФормированиеСпискаПоФильтру();
		
	Иначе
		
		Элементы.Фильтр.Видимость = Ложь;
		
		// Установка видимости дополнительных реквизитов списка
		Элементы.Остаток.Видимость           = Ложь;
		Элементы.ДатаИспользования.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Установим отображение подменю "Фильтр" на форме
	Элементы.Фильтр.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
